src/test/java/karatepoc/bolt/feature/jsonData/payslip.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/" xmlns:syb="http://schemas.datacontract.org/2004/07/Sybrin.Service.Handler">
    <soapenv:Header/>
    <soapenv:Body>
        <tem:Notify>
            <!--Optional:-->
            <tem:sybrinRequest>
                <!--Optional:-->
                <syb:Action>AddDocuments</syb:Action>
                <!--Optional:-->
                <syb:CaseID>${Properties#BRNumber}</syb:CaseID>
                <!--Optional:-->
                <syb:RequestXml>cid:288963799005</syb:RequestXml>
                <!--Optional:-->
                <syb:SybDocuments>
                    <syb:SybDocument>
                        <!--Optional:-->
                        <syb:ContentData>${Properties#PDF_Payslip}</syb:ContentData>
                        <!--Optional:-->
                        <syb:ContentDefinition>PAYSLIP</syb:ContentDefinition>
                        <!--Optional:-->
                        <syb:ContentID>?</syb:ContentID>
                        <!--Optional:-->
                        <syb:ContentLinkID>?</syb:ContentLinkID>
                        <!--Optional:-->
                        <syb:ContentMetaData>cid:42171493055</syb:ContentMetaData>
                        <!--Optional:-->
                        <syb:ContentPageNumber>?</syb:ContentPageNumber>
                        <!--Optional:-->
                        <syb:ContentSubDefinition>PAYSLIP</syb:ContentSubDefinition>
                        <!--Optional:-->
                        <syb:ContentType>PDF</syb:ContentType>
                        <!--Optional:-->
                        <syb:ContentURI>?</syb:ContentURI>
                    </syb:SybDocument>
                </syb:SybDocuments>
            </tem:sybrinRequest>
        </tem:Notify>
    </soapenv:Body>
</soapenv:Envelope>